driver-tests/bpelse/correlation/correlationJBI/test/TestInvokeCorrelation/Input2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:get="http://stc.com/GetStockQuote">
  <soapenv:Body>
    <get:GetQuote>
      <get:symbol>HELLO</get:symbol>
    </get:GetQuote>
  </soapenv:Body>
</soapenv:Envelope>